
# tap repositories and their packages

tap 'homebrew/core'
brew 'autojump'
brew 'axel'
brew 'bat'
brew 'brotli'
brew 'btop'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'coreutils'
brew 'diffutils'
brew 'findutils'
brew 'fontconfig'
brew 'freetype'
brew 'gawk'
brew 'gcc@11'
brew 'gettext'
brew 'giflib'
brew 'git'
brew 'glib'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'go'
brew 'gpatch'
brew 'graphite2'
brew 'grep'
brew 'harfbuzz'
brew 'iconsur'
brew 'icu4c@76'
brew 'isl'
brew 'jansson'
brew 'jpeg-turbo'
brew 'k6'
brew 'kotlin'
brew 'kubernetes-cli'
brew 'libevent'
brew 'libgit2'
brew 'libgit2@1.8'
brew 'libidn2'
brew 'liblinear'
brew 'libmpc'
brew 'libnghttp2'
brew 'libpng'
brew 'libsodium'
brew 'libssh2'
brew 'libtiff'
brew 'libunistring'
brew 'libuv'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'little-cms2'
brew 'llvm'
brew 'lua'
brew 'lxsplit'
brew 'lz4'
brew 'lzo'
brew 'make'
brew 'maven'
brew 'mpdecimal'
brew 'mpfr'
brew 'mtr'
brew 'ncurses'
brew 'neofetch'
brew 'nexttrace'
brew 'nmap'
brew 'node'
brew 'oniguruma'
brew 'openjdk'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'pcre2'
brew 'pipx'
brew 'pixman'
brew 'pkgconf'
brew 'popt'
brew 'python-packaging'
brew 'python@3.11'
brew 'python@3.12'
brew 'python@3.13'
brew 'quilt'
brew 'readline'
brew 'rsync'
brew 'ruby'
brew 'rust'
brew 'rustup'
brew 'screenresolution'
brew 'shellcheck'
brew 'sqlite'
brew 'telnet'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'utf8proc'
brew 'vim'
brew 'wget'
brew 'xorgproto'
brew 'xxhash'
brew 'xz'
brew 'z3'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'zstd'

tap 'homebrew/cask'
cask 'adrive'
cask 'baidunetdisk'
cask 'bartender'
cask 'blackhole-2ch'
cask 'charles'
cask 'cleanmymac-zh'
cask 'cursor'
cask 'datagrip'
cask 'docker'
cask 'douyin'
cask 'feishu'
cask 'folx'
cask 'font-hack-nerd-font'
cask 'google-chrome'
cask 'iina'
cask 'intellij-idea'
cask 'iterm2'
cask 'keepassxc'
cask 'keka'
cask 'kekaexternalhelper'
cask 'macs-fan-control'
cask 'microsoft-remote-desktop'
cask 'monitorcontrol'
cask 'neteasemusic'
cask 'paper'
cask 'postman'
cask 'qq'
cask 'qqmusic'
cask 'redis-insight'
cask 'rustrover'
cask 'stats'
cask 'telegram'
cask 'temurin@11'
cask 'temurin@17'
cask 'temurin@21'
cask 'temurin@8'
cask 'tencent-meeting'
cask 'thunder'
cask 'tradingview'
cask 'visual-studio-code'
cask 'wechat'
cask 'wetype'
cask 'wireshark'
cask 'zerotier-one'

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'

tap 'homebrew/cask-versions'

tap 'buo/cask-upgrade'

tap 'lencx/chatgpt'

tap 'lihaoyun6/tap'

tap 'rcmdnk/file'
brew 'brew-file'

# Other Homebrew packages
brew 'exa'

# Other Cask applications
cask 'clashx'

# App Store applications
mas 'Bob (1.14.0)', id: 1630034110
mas 'iShot (2.5.9)', id: 1485844094
mas 'Picsee (1.7.5)', id: 1454805783
mas 'wpsoffice (6.15.1)', id: 1443749478
mas 'Xcode (16.2)', id: 497799835
mas 'Xnip (2.2.6)', id: 1221250572
