tap "buo/cask-upgrade"
tap "filosottile/musl-cross"
tap "lihaoyun6/tap"
tap "rcmdnk/file"
brew "xz"
brew "python@3.11"
brew "autojump"
brew "axel"
brew "bat"
brew "btop"
brew "coreutils"
brew "diffutils"
brew "exa"
brew "findutils"
brew "fio"
brew "gawk"
brew "gcc@11"
brew "git"
brew "gnu-getopt"
brew "gnu-tar"
brew "go"
brew "grep"
brew "node"
brew "python@3.12"
brew "iconsur"
brew "icu4c@76"
brew "k6"
brew "kotlin"
brew "kubernetes-cli"
brew "libpq"
brew "lxsplit"
brew "make"
brew "maven"
brew "mtr"
brew "ncurses"
brew "neofetch"
brew "nexttrace"
brew "nmap"
brew "pipx"
brew "pkgconf"
brew "poppler"
brew "quilt"
brew "rsync"
brew "rust"
brew "rustup"
brew "shellcheck"
brew "smartmontools"
brew "tailscale", restart_service: :changed
brew "telnet"
brew "tmux"
brew "trash", link: true
brew "tree"
brew "vim"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "filosottile/musl-cross/musl-cross"
brew "rcmdnk/file/brew-file"
cask "adrive"
cask "baidunetdisk"
cask "blackhole-2ch"
cask "charles"
cask "clash-verge-rev"
cask "claude-code"
cask "cleanmymac-zh"
cask "datagrip"
cask "docker-desktop"
cask "douyin"
cask "feishu"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "hiddenbar"
cask "iina"
cask "intellij-idea"
cask "iterm2"
cask "keepassxc"
cask "keka"
cask "kekaexternalhelper"
cask "macs-fan-control"
cask "microsoft-auto-update"
cask "microsoft-remote-desktop"
cask "monitorcontrol"
cask "paper"
cask "postman"
cask "qq"
cask "qqmusic"
cask "redis-insight"
cask "rustrover"
cask "telegram"
cask "temurin@11"
cask "temurin@17"
cask "temurin@21"
cask "temurin@8"
cask "tencent-meeting"
cask "thunder"
cask "tradingview"
cask "visual-studio-code"
cask "wechat"
cask "wetype"
cask "winbox"
cask "wireshark-app"
cask "zerotier-one"
vscode "1yib.rust-bundle"
vscode "anthropic.claude-code"
vscode "dustypomerleau.rust-syntax"
vscode "fill-labs.dependi"
vscode "foxundermoon.shell-format"
vscode "george-alisson.html-preview-vscode"
vscode "lea21st.vscode-sql-formatter"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "redhat.vscode-xml"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
cargo "cross"
